Revit 2026 API

# FluidTypeClearAllTemperatures Method

---

Clears all fluid temperatures in the set.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ClearAllTemperatures()
```
```vb
Public Sub ClearAllTemperatures
```
```cpp
public:
void ClearAllTemperatures()
```
```fsharp
member ClearAllTemperatures : unit -> unit
```

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if some temperatures in the FluidType object are in use. |

#### Reference

FluidType Class

Autodesk.Revit.DB.Plumbing Namespace